[
    {
  "device": "phone",
  "components": {
    "battery": {
      "not charging": {
        "solution": "Check the charging cable and adapter for damage. Ensure the port is clean. Try a different charger and wall outlet. Restart your phone. If issues persist, the battery or charging port may need professional repair."
      },
      "drains fast": {
        "solution": "Reduce screen brightness and turn off unnecessary background apps and notifications. Check battery usage in settings to identify power-hungry apps. Consider enabling battery saver mode. If the battery is old, replacement might be needed."
      },
      "battery dead": {
        "solution": "Connect your phone to a charger for at least 30 minutes. Try a different charging cable and adapter. Attempt a force restart. If it doesn’t turn on, the battery may need replacement or there could be a hardware issue."
      },
      "overheating": {
        "solution": "Close unused apps, especially games or streaming services. Remove the phone from direct sunlight or hot environments. Take off the case if it's trapping heat. Avoid using the phone heavily while it's charging."
      },
      "not detected": {
        "solution": "Restart your phone. If the battery is removable and you're comfortable, try reseating it. This issue often indicates a hardware problem with the battery connection or the battery itself, potentially requiring professional service."
      },
      "slow charge": {
        "solution": "Use the original charger and cable if possible. Check for dirt or debris in the charging port. Close background apps drawing power. Avoid using the phone while charging. The cable or adapter might be faulty."
      },
      "battery swelling": {
        "solution": "Immediately stop using and charging the phone. A swollen battery is a safety hazard and can damage the phone or cause fire. Do not attempt to puncture or compress it. Contact a professional for battery replacement."
      },
      "battery percentage stuck": {
        "solution": "Restart your phone. Sometimes, a full charge and discharge cycle can recalibrate the battery sensor. If the issue persists, it might be a software glitch or a failing battery requiring professional assessment."
      },
      "won’t power on": {
        "solution": "Charge the phone for at least 30 minutes. Attempt a force restart. Check if the charging port is clean and the charger is working. If it still doesn't power on, it could be a battery, screen, or motherboard issue needing repair."
      },
      "rapid shutdown": {
        "solution": "This often indicates an aging or faulty battery that can't provide enough power under load. Update your phone's software. Calibrating the battery by fully charging and discharging might help. Otherwise, a battery replacement is likely needed."
      }
    },
    "display": {
      "black screen": {
        "solution": "Try a force restart. If the phone makes sounds but the screen is black, it might be a loose connection or display failure. Charge the phone for a while, as a completely drained battery can sometimes cause this."
      },
      "dim screen": {
        "solution": "Check brightness settings in the control center or display settings. Disable auto-brightness or adaptive brightness if it's causing issues. Ensure power-saving mode isn't overly dimming the screen. Overheating can also cause dimming."
      },
      "flicker": {
        "solution": "Restart your phone. Check if adaptive brightness or a blue light filter is causing it and disable them. Update your phone's operating system and apps. In rare cases, it could be a hardware issue like a loose display connector."
      },
      "cracked screen": {
        "solution": "A cracked screen is physical damage and typically requires professional repair or replacement of the display assembly. Using a screen protector and case can help prevent future damage. Be cautious of sharp edges."
      },
      "unresponsive screen": {
        "solution": "Restart your phone. Clean the screen with a soft, dry cloth. Remove any screen protector or case that might be interfering. If the issue persists, it could be a software glitch or hardware damage needing repair."
      },
      "screen touches itself": {
        "solution": "Clean the screen thoroughly. Restart the device. Remove any ill-fitting screen protector or case. Sometimes, moisture or a software bug can cause this. If it persists, a factory reset or professional repair might be necessary."
      },
      "dead pixels": {
        "solution": "Dead pixels are usually a hardware defect in the display and cannot be easily fixed with software. Sometimes a stuck pixel (a pixel showing a fixed color) can be massaged or fixed with apps, but true dead (black) pixels generally require screen replacement."
      },
      "screen colors wrong": {
        "solution": "Check display settings for any color correction, color filter, or night mode options that might be enabled. Restart the phone. Ensure the operating system is updated. If colors are inverted or strange, check accessibility settings."
      },
      "backlight off": {
        "solution": "Increase screen brightness to maximum. Try restarting the phone. If the display is faintly visible under bright light but has no backlight, it's likely a hardware failure of the backlight circuit or display, requiring professional repair."
      },
      "screen freeze": {
        "solution": "Attempt a force restart. If it happens frequently, try uninstalling recently added apps. Ensure you have enough free storage space. Update your phone's software. A factory reset might be needed if software-related."
      }
    },
    "touchscreen": {
      "touch not working": {
        "solution": "Restart your device. Clean the screen. Remove screen protectors or cases. If only a part of the screen is affected, it might be hardware damage. Software updates or a factory reset can sometimes fix software-related unresponsiveness."
      },
      "no touch": {
        "solution": "Perform a force restart. Ensure the screen is clean and dry. Screen protectors can sometimes interfere. If the phone was dropped or exposed to liquid, it might be hardware damage requiring professional repair."
      },
      "multi-touch not working": {
        "solution": "Restart the phone. Test in safe mode to see if a third-party app is causing the issue. Ensure the screen is clean. This could also be a software bug that an update might fix, or a hardware problem with the digitizer."
      },
      "touch lag": {
        "solution": "Restart your phone. Free up storage space and close background apps. Update your phone's software and all apps. Disable animations in developer options if comfortable. If lag persists, a factory reset could help."
      },
      "phantom touches": {
        "solution": "Clean the screen thoroughly. Remove any screen protector or case. Restart the phone. Check for moisture. In some cases, a faulty charger can cause this. If it persists, it could be a digitizer issue needing repair."
      },
      "touch inaccurate": {
        "solution": "Restart your phone. Clean the screen. Remove any screen protector. Some older phones had calibration settings, but modern ones rarely do. If it’s consistently inaccurate, it might be a software bug or a hardware problem."
      },
      "missed taps": {
        "solution": "Clean the screen. Ensure your fingers are clean and dry. Remove any thick screen protector. Try increasing touch sensitivity if your phone has this option. Restarting the device may also help with minor glitches."
      },
      "swipe not working": {
        "solution": "Restart the phone. Clean the screen. Check if a specific app has issues or if it's system-wide. Ensure no accessibility features are interfering. This could be a software glitch resolved by an update or reset."
      },
      "touchscreen no response": {
        "solution": "Force restart your phone. If it turns on but touch still doesn't work, clean the screen. Remove peripherals. A damaged screen, loose internal cable, or software corruption could be the cause, possibly needing professional help."
      },
      "touch unpredictable": {
        "solution": "Clean the screen thoroughly. Restart the device. Remove any screen protector. Boot into safe mode to check if a third-party app is responsible. Persistent issues may require a software update, factory reset, or hardware repair."
      }
    },
    "camera": {
      "camera crash": {
        "solution": "Restart your phone. Clear the cache and data for the camera app in settings. Update the camera app and your phone's operating system. If it persists, try booting in safe mode to check for app conflicts."
      },
      "black view": {
        "solution": "Restart the camera app and then your phone. Ensure the camera isn't obstructed. Try clearing the camera app's cache and data. Test with a third-party camera app. If the issue persists, it could be a hardware problem."
      },
      "blurry image": {
        "solution": "Clean the camera lens gently with a microfiber cloth. Tap the screen to focus or try manual focus if available. Ensure your hand is steady. Restart the phone. Remove any case or accessory that might interfere."
      },
      "focus fail": {
        "solution": "Clean the camera lens. Tap on the subject on your screen to help the camera focus. Ensure there's enough light. Restart the camera app and phone. Update camera app and OS. Persistent issues may indicate hardware damage."
      },
      "no camera": {
        "solution": "Restart your phone. Check app permissions to ensure the camera app has access. Clear camera app cache and data. If a \"camera failed\" error appears, it might be a software glitch or hardware issue requiring professional help."
      },
      "shutter stuck": {
        "solution": "Force close the camera app and reopen it. Restart your phone. Ensure there's enough free storage space on your device. If the issue persists, try clearing the camera app's cache and data, or check for software updates."
      },
      "app crash": {
        "solution": "Restart your phone. Update the camera app and the phone's operating system. Clear the camera app's cache and data. Free up storage space if your phone is full. Check for conflicting apps."
      },
      "camera flicker": {
        "solution": "Adjust your lighting conditions, as some artificial lights can cause flicker. Check camera settings for an anti-flicker or anti-banding option (50Hz/60Hz). Restart the phone and update the camera app and OS."
      },
      "photos too dark or bright": {
        "solution": "Clean the camera lens. Adjust the exposure by tapping on the screen and using the slider that appears. Try using HDR mode. Check if any specific scene modes or filters are enabled. Ensure proper lighting conditions."
      },
      "zoom fail": {
        "solution": "Restart the camera app and the phone. Clean the camera lens. Check if zoom works in other camera apps. This could be a software glitch fixed by an update or a hardware problem with the camera module."
      }
    },
    "speakers": {
      "no sound": {
        "solution": "Check if the volume is turned up and not on silent/vibrate mode. Restart your phone. Ensure Bluetooth is off or not connected to an audio device. Clean the speaker grille gently with a soft brush. Test with headphones."
      },
      "low volume": {
        "solution": "Increase the volume using the buttons. Clean the speaker grille gently, as dust can muffle sound. Check sound settings for any limiters. Restart your phone. Test in safe mode to rule out app interference."
      },
      "crackling": {
        "solution": "Lower the volume slightly, as very high volumes can cause distortion. Restart your phone. Check if it happens with all audio or specific apps. Debris in the speaker or water damage can also cause this, possibly requiring repair."
      },
      "distortion": {
        "solution": "Reduce the volume. Restart the phone. Ensure the audio file isn't the source of distortion. If it happens at all volumes and with all audio, the speaker might be damaged and require professional repair."
      },
      "one side audio": {
        "solution": "If using headphones, check the headphone connection or try another pair. For phone speakers (if stereo), check balance settings in accessibility options. Clean speaker grilles. This could also be a hardware fault needing repair."
      },
      "buzzing": {
        "solution": "Try lowering the volume. Restart your phone. Check if it happens with specific apps or all audio. It might be due to interference, a loose internal component, or a damaged speaker, which would need professional inspection."
      },
      "speaker mute": {
        "solution": "Ensure the phone is not in silent or do-not-disturb mode. Check the volume levels. Restart the device. Make sure no accessibility settings are muting audio. Test with different apps and with headphones."
      },
      "audio cutoff": {
        "solution": "Restart your phone. Check if it occurs with streaming services (possible network issue) or local files. Ensure enough storage space, as low storage can cause performance issues. Update apps and OS. Could be a hardware issue."
      },
      "static noise": {
        "solution": "Restart your phone. Test with different audio sources. Ensure the speaker grille is clean. If using wired headphones, check the port and connection. Persistent static might indicate a hardware problem with the speaker or audio jack."
      },
      "speaker rattle": {
        "solution": "This usually indicates a loose component inside the phone or a damaged speaker cone. Gently check if the phone's back cover is secure. This issue often requires professional inspection and repair to fix the physical problem."
      }
    },
    "microphone": {
      "mic dead": {
        "solution": "Restart your phone. Test the microphone with a voice recorder app. Ensure the microphone opening isn't blocked by dirt, debris, or a case. Check app permissions for microphone access. If it fails everywhere, it's likely hardware."
      },
      "low mic volume": {
        "solution": "Clean the microphone port gently with a soft, dry brush or compressed air. Remove any case or screen protector that might be obstructing it. Check microphone settings in apps if available. Restart the phone."
      },
      "no mic": {
        "solution": "Restart your phone. Grant microphone permissions to the app you're using. Clean the microphone opening. Test with different apps. If it's not working anywhere, it's likely a hardware failure requiring repair."
      },
      "muffled audio": {
        "solution": "Ensure the microphone hole is not covered by your hand, case, or debris. Clean it gently. Restart your phone. Test without any connected Bluetooth devices. Persistent issues might point to a hardware fault."
      },
      "mic crackle": {
        "solution": "Restart your phone. Check for loose debris near the microphone. Test if it occurs in all apps or just one. A poor cellular or Wi-Fi connection can sometimes cause crackling during calls. Hardware damage could also be a cause."
      },
      "mic distortion": {
        "solution": "Try speaking softer if you are too close or loud. Restart the phone. Ensure the microphone port is clean. Test in different apps. If distortion is consistent, the microphone hardware may be damaged."
      },
      "too much background noise": {
        "solution": "Move to a quieter environment if possible. Some phones have noise suppression features; check if it's enabled. Clean the microphone port. Ensure your phone's software is up to date, as updates can improve audio processing."
      },
      "caller can't hear me": {
        "solution": "Check if your microphone is muted. Restart your phone. Clean the microphone port. Ensure the phone app has microphone permission. Test with a voice recording. If it persists, it could be network issues or a faulty microphone."
      },
      "call drop": {
        "solution": "Check your signal strength; move to an area with better reception. Restart your phone. Reinsert your SIM card. Ensure your carrier settings are up to date. Frequent call drops might also indicate a SIM card or network hardware problem."
      },
      "my voice cuts out": {
        "solution": "Ensure a stable network connection (Wi-Fi or cellular). Clean the microphone port. Restart your phone. Close background apps that might be using resources. If it happens on all calls, the microphone hardware might be failing."
      }
    },
    "charging port": {
      "port loose": {
        "solution": "This usually indicates physical wear or damage to the charging port. Be very gentle when connecting the cable. Using a different, high-quality cable might help temporarily. Professional repair or port replacement is often needed."
      },
      "no contact": {
        "solution": "Carefully clean the charging port with a soft, dry brush or compressed air to remove lint or debris. Try a different charging cable and adapter. If there's still no contact, the port might be damaged internally and require repair."
      },
      "spark from port": {
        "solution": "Immediately unplug the charger. Do not attempt to use the port or charger again. This is a serious safety risk indicating a short circuit or severe damage. The port and possibly the charger need professional inspection and repair."
      },
      "port jammed": {
        "solution": "Visually inspect the port for foreign objects. If you see something, try to remove it very carefully with a non-metallic, thin tool (like a wooden toothpick), or use compressed air. If unsure, seek professional help to avoid damage."
      },
      "dirt in port": {
        "solution": "Turn off the phone. Use a can of compressed air to blow out debris. Alternatively, gently use a soft, dry, non-metallic tool like a wooden or plastic toothpick to carefully clean out lint. Avoid damaging the pins."
      },
      "broken pin": {
        "solution": "If a pin inside the charging port is visibly bent or broken, do not attempt to use it, as it can cause further damage or a short circuit. The charging port will need to be professionally replaced."
      },
      "intermittent charging": {
        "solution": "Try a different charging cable and adapter. Clean the charging port. The port itself might be loose or damaged. Wiggling the cable to get it to charge is a temporary fix; port repair or replacement is likely needed."
      },
      "slow charge": {
        "solution": "Ensure you are using a compatible, high-quality charger and cable. Clean the charging port. Close power-hungry apps running in the background. If the port is damaged or worn, it may not make a good connection, leading to slow charging."
      },
      "port fail": {
        "solution": "If cleaning the port and trying different cables/chargers doesn't work, the charging port has likely failed due to damage or wear. It will need to be professionally repaired or replaced to restore charging functionality."
      },
      "charger not detected": {
        "solution": "Clean the charging port. Try a different charger and cable. Restart your phone. This can be due to a faulty port, cable, adapter, or even a software issue. If problems persist, professional diagnosis is needed."
      }
    },
    "network radio": {
      "wifi drop": {
        "solution": "Restart your phone and Wi-Fi router. Forget the Wi-Fi network and reconnect. Ensure your phone's OS is updated. Check if other devices on the same network have issues. Reset network settings on your phone if persistent."
      },
      "no wifi": {
        "solution": "Ensure Wi-Fi is turned on in your phone settings. Restart your phone and router. Check if other devices can connect to the Wi-Fi. Try connecting to a different network. Resetting network settings might help."
      },
      "slow wifi": {
        "solution": "Restart your phone and Wi-Fi router. Move closer to the router. Check for interference from other devices. Test Wi-Fi speed on other devices. Too many devices on the network can also slow it down."
      },
      "no sim": {
        "solution": "Restart your phone. Remove and reinsert the SIM card. Ensure the SIM card is inserted correctly and not damaged. Try the SIM card in another phone to see if the SIM is faulty. Contact your carrier if needed."
      },
      "no signal": {
        "solution": "Check if you are in an area with network coverage. Restart your phone. Toggle Airplane mode on and off. Reseat your SIM card. Check for carrier outages. If persistent, it could be a SIM or hardware issue."
      },
      "LTE drop": {
        "solution": "Toggle Airplane mode. Restart your phone. Check for carrier software updates. Reset network settings. This could be due to poor coverage in your area or a temporary network issue. Contact your carrier if it persists."
      },
      "5g fail": {
        "solution": "Ensure your phone plan and SIM card support 5G. Verify you are in a 5G coverage area. Restart your phone. Toggle Airplane mode. Check for carrier settings updates. Reset network settings if the problem continues."
      },
      "no bluetooth": {
        "solution": "Ensure Bluetooth is enabled on your phone. Restart your phone. Toggle Bluetooth off and on. Unpair and re-pair the Bluetooth device. Check if the Bluetooth device is discoverable and charged. Update your phone's OS."
      },
      "pairing fail": {
        "solution": "Ensure both devices are in pairing mode and close to each other. Turn Bluetooth off and on for both. Restart both devices. Clear the Bluetooth cache on your phone. Remove the device from paired list and try again."
      },
      "network error": {
        "solution": "Toggle Airplane mode on and off. Restart your phone. Reset network settings. Check for outages with your mobile carrier or internet service provider. Ensure your account is in good standing and data services are active."
      }
    },
    "storage": {
      "full storage": {
        "solution": "Delete unnecessary apps, photos, videos, and files. Clear app caches. Transfer files to a computer or cloud storage. Use a storage analyzer tool to see what's taking up space. Add an SD card if your phone supports it."
      },
      "can't open files": {
        "solution": "Ensure you have a compatible app to open the file type. Check if the file is corrupted; try downloading it again. Ensure there's enough free storage. Restart your phone. The storage itself might have errors."
      },
      "can't save files": {
        "solution": "Check if you have enough free storage space. Ensure the app has permission to write to storage. Restart the phone. If saving to an SD card, ensure it's not corrupted or write-protected."
      },
      "slow storage": {
        "solution": "Free up storage space, as near-full storage can slow down performance. Clear caches of apps. Uninstall unused apps. Restart the phone. If performance is extremely poor, the storage hardware might be failing."
      },
      "storage corrupt": {
        "solution": "This is a serious issue. If it's an SD card, try reading it on a computer with recovery software (data loss is possible). For internal storage, a factory reset might be the only option, which erases all data. Professional help may be needed."
      },
      "storage not showing up": {
        "solution": "If it's an SD card, remove and reinsert it. Try it in another device or a card reader. Restart your phone. The card might be corrupted or improperly formatted. For internal storage issues, seek professional help."
      },
      "file error": {
        "solution": "Try opening the file with a different app. The file itself might be corrupted or in an unsupported format. Download the file again if possible. Ensure your phone's software is up to date."
      },
      "format fail": {
        "solution": "If trying to format an SD card, attempt formatting it on a computer. Ensure the card is not physically damaged or write-protected. The SD card itself might be faulty and need replacement."
      },
      "data loss": {
        "solution": "If files are accidentally deleted, stop using the phone immediately to avoid overwriting data. Try data recovery software (results vary). Regularly back up your phone to prevent permanent data loss. Professional data recovery services exist."
      },
      "storage problem": {
        "solution": "Restart your phone. Update the operating system. If an SD card is involved, test it for errors on a computer. Persistent internal storage problems may require a factory reset (backup data first) or professional repair."
      }
    },
    "fingerprint": {
      "not working": {
        "solution": "Clean the fingerprint sensor and your finger. Restart your phone. Re-register your fingerprint in settings. Ensure your phone's software is updated. If it still fails, the sensor might be dirty internally or damaged."
      },
      "not detected": {
        "solution": "Ensure the fingerprint sensor is clean. Restart your phone. Try re-adding your fingerprints in the security settings. If the option to set up fingerprints is missing or greyed out, it could be a hardware issue needing repair."
      },
      "can’t scan": {
        "solution": "Clean both the sensor and your finger. Ensure your finger covers the sensor properly. Moisture, dirt, or scars can affect scanning. Try registering the same finger multiple times at different angles in settings."
      },
      "scan failed": {
        "solution": "Wipe the sensor and your finger dry. Try a different registered finger. Restart your phone. Delete existing fingerprints and add them again carefully. Too many failed attempts can temporarily disable the sensor."
      },
      "too slow": {
        "solution": "Clean the fingerprint sensor. Restart your phone. Re-register your fingerprints. Sometimes, software updates can improve sensor performance. Ensure no thick screen protector is interfering if it's an in-display sensor."
      },
      "scan error": {
        "solution": "Clean the sensor and your finger. Restart your device. Remove and re-add your fingerprints. Ensure the phone's software is up to date. Persistent errors may indicate a faulty sensor requiring professional attention."
      },
      "won’t unlock": {
        "solution": "Clean the sensor and your finger. Ensure you are using a registered finger. Restart the phone. Re-add your fingerprint data. If many attempts fail, you might be locked out; use your PIN/password/pattern to unlock first."
      },
      "unlock failed": {
        "solution": "Make sure the sensor and your finger are clean and dry. Try again, ensuring full contact. If it repeatedly fails, use your alternative unlock method (PIN/pattern). Consider re-registering your fingerprints for better accuracy."
      },
      "reader stuck": {
        "solution": "If referring to a physical button, check for debris. If it's software-related (not responding), restart the phone. Clear cache for fingerprint-related system apps if possible. A hardware issue might need repair."
      },
      "not responding": {
        "solution": "Restart your phone. Clean the fingerprint sensor. Check for software updates. If the sensor consistently doesn't respond, even after re-adding fingerprints, it might be a hardware malfunction needing professional repair."
      }
    }
  }
}
]